{"keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "name": "input_3", "config": {"sparse": false, "name": "input_3", "dtype": "int32", "batch_input_shape": [null, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_1", "config": {"input_length": null, "name": "embedding_1", "dtype": "float32", "mask_zero": false, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "output_dim": 100, "input_dim": 10, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, null]}, "class_name": "Embedding"}, {"inbound_nodes": [], "name": "input_2", "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 100]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "flatten_2", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "name": "multiply_1", "config": {"name": "multiply_1", "trainable": true}, "class_name": "Multiply"}, {"inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "sequential_2", "config": {"layers": [{"config": {"name": "dense_3", "dtype": "float32", "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 6272, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 100], "trainable": true}, "class_name": "Dense"}, {"config": {"name": "reshape_1", "target_shape": [7, 7, 128], "trainable": true}, "class_name": "Reshape"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.8}, "class_name": "BatchNormalization"}, {"config": {"interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.8}, "class_name": "BatchNormalization"}, {"config": {"interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.8}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "name": "sequential_2"}, "class_name": "Sequential"}], "name": "model_2", "output_layers": [["sequential_2", 1, 0]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}