{"keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "sequential_1", "config": {"layers": [{"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "batch_input_shape": [null, 28, 28, 1]}, "class_name": "Conv2D"}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[0, 1], [0, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.8}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "name": "dropout_3", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.8}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "name": "dropout_4", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}], "name": "sequential_1"}, "class_name": "Sequential"}, {"inbound_nodes": [[["sequential_1", 1, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["sequential_1", 1, 0, {}]]], "name": "dense_2", "config": {"trainable": true, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 10, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}